[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/p2TKJVV/kindpng-1064993.png",
        "review": "A mesmerizing tale of love, ambition, and tragedy set in the roaring 1920s. F. Scott Fitzgerald's masterpiece captivates readers with its richly drawn characters and vivid portrayal of the Jazz Age. Through the enigmatic figure of Jay Gatsby, Fitzgerald explores the American Dream and its elusive nature. The Great Gatsby is a timeless classic that continues to resonate with readers, offering profound insights into the complexities of human desire and the pursuit of happiness.",
        "totalPages": 218,
        "rating": 4.5,
        "category": "Classic Literature",
        "tags": ["Romance", "Drama"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/wRBnQyV/kindpng-2193744-1-1.png",
        "review": "A poignant portrayal of teenage angst and rebellion that remains relevant across generations. J.D. Salinger's iconic novel follows Holden Caulfield, a disenchanted teenager navigating the complexities of adolescence and society. Through Holden's candid voice, Salinger captures the essence of youth alienation and the quest for authenticity. The Catcher in the Rye is a timeless classic that continues to resonate with readers of all ages, offering profound insights into the human condition and the search for identity.",
        "totalPages": 224,
        "rating": 4.3,
        "category": "Literary Fiction",
        "tags": ["Coming-of-age", "Psychological"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 3,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/JdZ7Lc4/kindpng-2592315-1.png",
        "review": "A powerful narrative addressing racial injustice and moral growth through the eyes of a child. Harper Lee's timeless masterpiece tells the story of Scout Finch, a young girl growing up in the racially charged atmosphere of the American South. Through Scout's innocence and curiosity, Lee explores themes of prejudice, empathy, and courage. To Kill a Mockingbird is a poignant reminder of the importance of compassion and integrity in the face of adversity.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Modern Classics",
        "tags": ["Social Issues", "Legal Drama"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
     {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/gr9hWrp/kindpng-4945926-1.png",
       "review": "A timeless romance with sharp wit and social commentary, exploring love and societal norms. Jane Austen's classic novel follows the tumultuous relationship between Elizabeth Bennet and Mr. Darcy, set against the backdrop of Georgian England. Through Austen's keen observations and sparkling prose, Pride and Prejudice delves into themes of class, marriage, and individuality. With its memorable characters and witty dialogue, this novel continues to enchant readers worldwide.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Romantic Fiction",
        "tags": ["Regency", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    }
 
    ,
    {
        "bookId": 5,
        "bookName": "Moby-Dick",
        "author": "Herman Melville",
        "image": "https://i.ibb.co/9sbTGhj/kindpng-7318921.png",
       "review": "An epic tale of obsession and revenge on the high seas, with rich symbolism and intricate characters. Herman Melville's masterpiece follows Captain Ahab's relentless pursuit of the white whale, Moby Dick, across the vast ocean. Through vivid imagery and philosophical digressions, Melville explores themes of fate, free will, and the human condition. Moby-Dick is a sprawling adventure that delves into the depths of the human soul, leaving readers awestruck and contemplative.",
        "totalPages": 635,
        "rating": 4.4,
        "category": "Adventure",
        "tags": ["Sea Story", "Symbolism"],
        "publisher": "Richard Bentley",
        "yearOfPublishing": 1851
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/QKTt9Zr/kindpng-5624060-1.png",
       "review": "An enchanting adventure in Middle-earth, filled with magic, courage, and friendship. J.R.R. Tolkien's beloved tale follows Bilbo Baggins, a hobbit who embarks on a quest to reclaim treasure guarded by the dragon Smaug. Along the way, Bilbo encounters trolls, elves, and goblins, forming unexpected alliances and discovering his own inner strength. The Hobbit is a timeless classic that transports readers to a world of wonder and imagination.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    }
]
